app/controllers/debug_caibai_controller.rb

	def index
		@recorders = CanbaiRewardRecorder.all
---
SELECT `canbai_reward_recorders`.* FROM `canbai_reward_recorders`

	def edit
		@recorder = CanbaiRewardRecorder.find(params[:id])
---
SELECT `canbai_reward_recorders`.* FROM `canbai_reward_recorders` WHERE `canbai_reward_recorders`.`id` = 4 LIMIT 1

	def save
		@recorder = CanbaiRewardRecorder.find(params[:id])
		if params[:is_canbai] == '1'
			@recorder.last_canbai_time = Time.now.to_date
		else
			@recorder.last_canbai_time = Time.now.to_date.yesterday
		end

		@recorder.r_type = params[:post][:r_type]
		@recorder.accumulated_continuous_time = params[:post][:accumulated_continuous_time]

		if @recorder.save
---
SELECT `canbai_reward_recorders`.* FROM `canbai_reward_recorders` WHERE `canbai_reward_recorders`.`id` = 5 LIMIT 1
UPDATE `canbai_reward_recorders` SET `last_canbai_time` = '2013-07-17', `accumulated_continuous_time` = 20, `updated_at` = '2013-07-18 03:37:22' WHERE `canbai_reward_recorders`.`id` = 5