app/controllers/jianghu_controller.rb

  def update_recorder
    re, user = validate_session_key(get_params(params, :session_key))
    return unless re

    scene_id = params[:scene_id]
    item_id = params[:item_id]
    star = params[:star]
    is_finish = params[:is_finish]

    if scene_id.nil? || scene_id.to_i < 0 || item_id.nil? || item_id.to_i < 0 ||
        star.nil? || star.to_i < 0 || star.to_i > 3 || is_finish.nil? || is_finish.to_i < 0
      render_result(ResultCode::INVALID_PARAMETERS, {err_msg: URI.encode('invalid parameters...')})
      return
    end
    re, err_msg = JianghuRecorder.update_recorder(user, scene_id.to_i, item_id.to_i, star.to_i, is_finish.to_i)
---
UPDATE `jianghu_recorders` SET `fight_time` = 2, `updated_at` = '2013-05-26 17:02:39' WHERE `jianghu_recorders`.`id` = 12

  def update_recorder_fight_time_and_gold
    re,user = validate_session_key(get_params(params, :session_key))
    return unless re

    scene_id = params[:scene_id]
    item_id = params[:item_id]
    gold = params[:gold]

    if scene_id.nil? || scene_id.to_i < 0 || item_id.nil? || item_id.to_i < 0 ||
        gold.nil? || gold.to_i < 0
      render_result(ResultCode::INVALID_PARAMETERS, {err_msg: URI.encode('invalid parameters')})
      return
    end
    re,err_msg = JianghuRecorder.update_recorder_fight_time_and_gold(user, scene_id.to_i, item_id.to_i, gold.to_i)
---
UPDATE `jianghu_recorders` SET `fight_time` = 0, `updated_at` = '2013-05-26 19:09:22' WHERE `jianghu_recorders`.`id` = 16
UPDATE `users` SET `gold` = 15, `updated_at` = '2013-05-26 19:09:22' WHERE `users`.`id` = 4