app/controllers/kapai_controller.rb

UPDATE `disciples` SET `experience` = 8, `updated_at` = '2013-05-26 16:56:03' WHERE `disciples`.`id` = 15
---
  def update_disciples
    re, user = validate_session_key(get_params(params, :session_key))
    return unless re

    disciples = params[:disciples]
    if disciples.nil? || !disciples.kind_of?(Array)
      render_result(ResultCode::INVALID_PARAMETERS, {err_msg: URI.encode('invalid parameters')})
      return
    end

    re, err_msg = Disciple.update_disciples(user, disciples)

UPDATE `equipment` SET `level` = 1, `grow_strength` = 3.0, `updated_at` = '2013-05-26 16:56:44' WHERE `equipment`.`id` = 34
---
  def update_equipments
    re, user = validate_session_key(get_params(params, :session_key))
    return unless re

    equipments = params[:equipments]
    if equipments.nil? || !equipments.kind_of?(Array)
      render_result(ResultCode::INVALID_PARAMETERS, {err_msg: URI.encode('invalid parameters')})
      return
    end

    re, err_msg = Equipment.update_equipments(user, equipments)

INSERT INTO `equipment` (`created_at`, `disciple_id`, `e_type`, `grow_strength`, `level`, `position`, `updated_at`, `user_id`) VALUES ('2013-05-26 16:55:43', -1, 'equipment_weapon_2002', 0.0, 0, -1, '2013-05-26 16:55:43', 4)
---
  def create_equipment
    re, user = validate_session_key(get_params(params, :session_key))
    return unless re

    type = get_params(params, :type)

    eq = Equipment.new(e_type: type, level: 1, grow_strength: 0.0,
                       user_id: user.id, position: -1, disciple_id: -1)
    unless eq.save

INSERT INTO `disciples` (`break_time`, `created_at`, `d_type`, `experience`, `grow_attack`, `grow_blood`, `grow_defend`, `grow_internal`, `level`, `potential`, `updated_at`, `user_id`) VALUES (0, '2013-05-26 16:58:29', 'disciple_3311', 0, 0.0, 0.0, 0.0, 0.0, 1, 0, '2013-05-26 16:58:29', 4)
---
  def create_disciple
    re, user = validate_session_key(get_params(params, :session_key))
    return unless re

    type = get_params(params, :type)

    disciple = Disciple.create_disciple(user, type)