app/controllers/qiyu_controller.rb

SELECT `canbai_reward_recorders`.* FROM `canbai_reward_recorders` WHERE `canbai_reward_recorders`.`user_id` = 1 LIMIT 1
INSERT INTO `canbai_reward_recorders` (`accumulated_continuous_time`, `created_at`, `last_canbai_time`, `r_type`, `updated_at`, `user_id`) VALUES (0, '2013-07-18 03:36:46', '1900-01-01', 3, '2013-07-18 03:36:46', 1)
UPDATE `canbai_reward_recorders` SET `accumulated_continuous_time` = 1, `last_canbai_time` = '2013-07-18', `updated_at` = '2013-07-18 03:36:46' WHERE `canbai_reward_recorders`.`id` = 5
---
  def canbai
    re, user = validate_session_key(get_params(params, :session_key))
    return unless re

    recorder = CanbaiRewardRecorder.find_by_user_id(user.id)
    if recorder.nil?
      recorder = CanbaiRewardRecorder.new
      recorder.user = user
      recorder.save