app/controllers/user_controller.rb

  def receive_login_reward
    re, user = validate_session_key(get_params(params, :session_key))
    return unless re

    continuous_login_reward = ContinuousLoginReward.find_by_user_id(user.id)
    continuous_login_reward.receive_or_not = ContinuousLoginReward::RECEIVED
    if continuous_login_reward.save
---
SELECT `continuous_login_rewards`.* FROM `continuous_login_rewards` WHERE `continuous_login_rewards`.`user_id` = 3 LIMIT 1
UPDATE `continuous_login_rewards` SET `receive_or_not` = 1, `updated_at` = '2013-05-27 18:09:03' WHERE `continuous_login_rewards`.`id` = 6

  def update_user_info
    re, user = validate_session_key(get_params(params, :session_key))
    return unless re

    name = get_params(params, :name)
    unless user.update_info(name, params)
---
UPDATE `users` SET `level` = 2, `gold` = 10, `silver` = 1946, `power` = 18, `experience` = 12, `updated_at` = '2013-05-26 17:09:18' WHERE `users`.`id` = 4

  def update_zhangmen_name
    re, user = validate_session_key(get_params(params, :session_key))
    return unless re

    zhangmen_name = get_params(params, :zhangmen_name)
    if zhangmen_name.nil? || zhangmen_name.length <= 0
      render_result(ResultCode::INVALID_PARAMETERS, {err_msg: "invalid parameters"})
      return
    end
    user.update_zhangmen_name(zhangmen_name)
---
UPDATE `users` SET `name` = '定襄县水曹掾', `updated_at` = '2013-05-26 16:54:27' WHERE `users`.`id` = 4

  def get_random_zhangmen_name
    re, user = validate_session_key(get_params(params, :session_key))
    return unless re

    location_array = ZhangmenrenConfig.instance.zhangmen_name_config['location']
    name_array = ZhangmenrenConfig.instance.zhangmen_name_config['name']
    location = "#{location_array[rand(location_array.size)]}"
    name = "#{name_array[rand(name_array.size)]}"
    while User.exists?(name: name)
---
SELECT 1 AS one FROM `users` WHERE `users`.`name` = 'randomnameB020' LIMIT 1

  def set_direction_step
    re, user = validate_session_key(get_params(params, :session_key))
    return unless re

    direction_step = params[:direction_step]
    if direction_step.nil? || direction_step.to_i < 0
      render_result(ResultCode::INVALID_PARAMETERS, {err_msg: 'invalid parameters'})
      return
    end

    user.direction_step = direction_step
    user.save
---
UPDATE `users` SET `session_key` = '2798330dfebfca571900ee759b119c2e22bd79220d277f1edc8ede9c96009ce1', `last_login_ip` = '192.168.1.109', `last_login_time` = '2013-05-27 18:08:27', `updated_at` = '2013-05-27 18:08:27' WHERE `users`.`id` = 3